In [1]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path

# File to Load (Remember to Change These)
school_data_to_load = Path("C:/Users/ormon/OneDrive/Desktop/pandas-challenge/PyCitySchools/Resources/schools_complete.csv")
student_data_to_load = Path("C:/Users/ormon/OneDrive/Desktop/pandas-challenge/PyCitySchools/Resources/students_complete.csv")

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [28]:
# Calculate the total number of unique schools
# Calculate the total number of unique schools


school_count = len(school_data_complete["school_name"].unique())
school_count

15

In [5]:
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [10]:
school_data_reduced_df = school_data_complete[["School ID", "school_name", "reading_score", "math_score"]]
school_data_reduced_df

       School ID         school_name  reading_score  math_score
0              0   Huang High School             66          79
1              0   Huang High School             94          61
2              0   Huang High School             90          60
3              0   Huang High School             67          58
4              0   Huang High School             97          84
...          ...                 ...            ...         ...
39165         14  Thomas High School             99          90
39166         14  Thomas High School             95          70
39167         14  Thomas High School             73          84
39168         14  Thomas High School             99          90
39169         14  Thomas High School             95          75

[39170 rows x 4 columns]

In [23]:
school_data_reduced_df.pivot_table(index="school_name", values=["reading_score", "math_score"], aggfunc="mean")

                       math_score  reading_score
school_name
Bailey High School      77.048432      81.033963
Cabrera High School     83.061895      83.975780
Figueroa High School    76.711767      81.158020
Ford High School        77.102592      80.746258
Griffin High School     83.351499      83.816757
Hernandez High School   77.289752      80.934412
Holden High School      83.803279      83.814988
Huang High School       76.629414      81.182722
Johnson High School     77.072464      80.966394
Pena High School        83.839917      84.044699
Rodriguez High School   76.842711      80.744686
Shelton High School     83.359455      83.725724
Thomas High School      83.418349      83.848930
Wilson High School      83.274201      83.989488
Wright High School      83.682222      83.955000

In [24]:
average_df = school_data_reduced_df.pivot_table(index="school_name", values=["reading_score", "math_score"], aggfunc="mean")
average_df

                       math_score  reading_score
school_name
Bailey High School      77.048432      81.033963
Cabrera High School     83.061895      83.975780
Figueroa High School    76.711767      81.158020
Ford High School        77.102592      80.746258
Griffin High School     83.351499      83.816757
Hernandez High School   77.289752      80.934412
Holden High School      83.803279      83.814988
Huang High School       76.629414      81.182722
Johnson High School     77.072464      80.966394
Pena High School        83.839917      84.044699
Rodriguez High School   76.842711      80.744686
Shelton High School     83.359455      83.725724
Thomas High School      83.418349      83.848930
Wilson High School      83.274201      83.989488
Wright High School      83.682222      83.955000

In [25]:
average_df.columns

Index(['math_score', 'reading_score'], dtype='object')

In [29]:
school_reading_average = average_df["math_score"]
school_reading_average.head(15)

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [14]:
school_data_grouped = school_data_reduced_df.groupby(["School ID"])
print(school_data_grouped)
school_data_grouped.head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025F8D5E3250>

       School ID         school_name  reading_score  math_score
0              0   Huang High School             66          79
1              0   Huang High School             94          61
2              0   Huang High School             90          60
3              0   Huang High School             67          58
4              0   Huang High School             97          84
...          ...                 ...            ...         ...
37535         14  Thomas High School             76          76
37536         14  Thomas High School             84          82
37537         14  Thomas High School             80          90
37538         14  Thomas High School             71          69
37539         14  Thomas High School             86          76

[75 rows x 4 columns]

In [17]:
school_data_grouped[["reading_score", "math_score"]].mean()

           reading_score  math_score
School ID
0              81.182722   76.629414
1              81.158020   76.711767
2              83.725724   83.359455
3              80.934412   77.289752
4              83.816757   83.351499
5              83.989488   83.274201
6              83.975780   83.061895
7              81.033963   77.048432
8              83.814988   83.803279
9              84.044699   83.839917
10             83.955000   83.682222
11             80.744686   76.842711
12             80.966394   77.072464
13             80.746258   77.102592
14             83.848930   83.418349

In [18]:
avg_reading = school_data_grouped["reading_score"].mean()
avg_math = school_data_grouped["math_score"].mean()

In [3]:
# Calculate the total number of unique students
student_count = len(student_data["Student ID"].unique())
student_count

39170

In [4]:
# Calculate the total budget
total_budget = school_data["budget"].sum()
total_budget

24649428

In [5]:
# Calculate the average (mean) math score
average_math_score = student_data["math_score"].mean()
average_math_score

78.98537145774827

In [6]:
# Calculate the average (mean) reading score
average_reading_score = student_data["reading_score"].mean()
average_reading_score

81.87784018381414

In [7]:
# Use the following to calculate the percentage of students who passed math (math scores greather than or equal to 70)
passing_math_count = school_data_complete[(school_data_complete["math_score"] >= 70)].count()["student_name"]
passing_math_percentage = passing_math_count / float(student_count) * 100
passing_math_percentage

74.9808526933878

In [8]:
# Calculate the percentage of students who passed reading (hint: look at how the math percentage was calculated)  
passing_reading_count = school_data_complete[(school_data_complete["reading_score"] >= 70)].count()["student_name"]
passing_reading_percentage = passing_reading_count / float(student_count) * 100
passing_reading_percentage

85.80546336482001

In [9]:
# Use the following to calculate the percentage of students that passed math and reading
passing_math_reading_count = school_data_complete[
    (school_data_complete["math_score"] >= 70) & (school_data_complete["reading_score"] >= 70)
].count()["student_name"]
overall_passing_rate = passing_math_reading_count /  float(student_count) * 100
overall_passing_rate

65.17232575950983

In [11]:
# Create a high-level snapshot of the district's key metrics in a DataFrame
district_summary = pd.DataFrame({"Total Schools": [school_count],
                                "Total Students": student_count,
                                "Total Budget": total_budget,
                                "Average Math Score": average_math_score,
                                "Average Reading Score": average_reading_score,
                                "% Passing Math": passing_math_percentage,
                                "% Passing Reading": passing_reading_percentage,
                                "% Overall Passing": overall_passing_rate})

# Formatting
#district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
#district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

# Display the DataFrame
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

# School Summary

In [10]:
# Use the code provided to select all of the school types
school_types = school_data["type"].unique()
school_types

array(['District', 'Charter'], dtype=object)

In [12]:
# Calculate the total student count per school
#per_school_counts = school_data_complete["school_name"].value_counts()
#per_school_counts.head(15)

#per_school_counts = school_data_complete["school_name"].value_counts()
#per_school_counts
per_school_counts = school_data["size"]
per_school_counts

#per_school_counts = school_data_complete.groupby(["school_name"])
#per_school_counts.count().head(15)

0     2917
1     2949
2     1761
3     4635
4     1468
5     2283
6     1858
7     4976
8      427
9      962
10    1800
11    3999
12    4761
13    2739
14    1635
Name: size, dtype: int64

In [13]:
# Calculate the total school budget and per capita spending per school

per_school_budget = school_data["budget"]
per_school_budget

#per_school_budget = school_data_complete.loc[:,["school_name","budget"]]
#per_school_budget = per_school_budget.drop_duplicates()
#per_school_budget

per_school_capita = per_school_budget / per_school_counts
per_school_capita

0     655.0
1     639.0
2     600.0
3     652.0
4     625.0
5     578.0
6     582.0
7     628.0
8     581.0
9     609.0
10    583.0
11    637.0
12    650.0
13    644.0
14    638.0
dtype: float64

In [15]:
# Calculate the average test scores per school
per_school_math_df = school_data_complete.groupby[["School_ID", "math_score"]].mean()
per_school_math_df
#per_school_math = 
#per_school_reading =

TypeError: 'method' object is not subscriptable

In [45]:
school_data_complete = school_data_complete.set_index("school_name")
per_school_df = school_data_complete.groupby(['school_name'])
per_school_df

KeyError: "None of ['school_name'] are in the columns"

In [ ]:
# Calculate the number of students per school with math scores of 70 or higher
students_passing_math = 
school_students_passing_math =

In [ ]:
# Calculate the number of students per school with reading scores of 70 or higher
students_passing_reading = 
school_students_passing_reading =

In [ ]:
# Use the provided code to calculate the number of students per school that passed both math and reading with scores of 70 or higher
students_passing_math_and_reading = school_data_complete[
    (school_data_complete["reading_score"] >= 70) & (school_data_complete["math_score"] >= 70)
]
school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["school_name"]).size()

In [ ]:
# Use the provided code to calculate the passing rates
per_school_passing_math = school_students_passing_math / per_school_counts * 100
per_school_passing_reading = school_students_passing_reading / per_school_counts * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_counts * 100

In [ ]:
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary = 

# Formatting
per_school_summary["Total School Budget"] = per_school_summary["Total School Budget"].map("${:,.2f}".format)
per_school_summary["Per Student Budget"] = per_school_summary["Per Student Budget"].map("${:,.2f}".format)

# Display the DataFrame
per_school_summary